basic/controllers/LiuyanController.php

        public function actionIndex(){
			$query = Liuyan::find()->orderBy('l_id desc');
			$countQuery = clone $query;
			$pages = new Pagination([
				'totalCount' => $countQuery->count(),
				'pageSize'=>4
				]);
			$models = $query->offset($pages->offset)
				->limit($pages->limit)
				->all();
---
SELECT COUNT(*) FROM `liuyan` ORDER BY `l_id` DESC
SELECT * FROM `liuyan` ORDER BY `l_id` DESC LIMIT 4 OFFSET 4

		public function actionAdd(){
			$request=Yii::$app->request;
			$name=$request->get('l_name');
			$liuyan=new Liuyan();
			$liuyan->l_name=''.$name.'';
			$re=$liuyan->save();
			if($re){
				$query = Liuyan::find()->orderBy('l_id desc');
			$countQuery = clone $query;
			$pages = new Pagination([
				'totalCount' => $countQuery->count(),
				'pageSize'=>4
				]);
			$models = $query->offset($pages->offset)
				->limit($pages->limit)
				->all();
---
INSERT INTO `liuyan` (`l_name`) VALUES ('666')
SELECT COUNT(*) FROM `liuyan` ORDER BY `l_id` DESC
SELECT * FROM `liuyan` ORDER BY `l_id` DESC LIMIT 4

		public function actionDel(){
			$request=Yii::$app->request;
			$id=$request->get('id');
			$result=Liuyan::find()->where(['l_id'=>$id])->one();
			$re=$result->delete();
			if($re){
				$query = Liuyan::find()->orderBy('l_id desc');
				$countQuery = clone $query;
				$pages = new Pagination([
					'totalCount' => $countQuery->count(),
					'pageSize'=>4
					]);
				$models = $query->offset($pages->offset)
					->limit($pages->limit)
					->all();
---
SELECT * FROM `liuyan` WHERE `l_id`='38'
DELETE FROM `liuyan` WHERE `l_id`=38
SELECT COUNT(*) FROM `liuyan` ORDER BY `l_id` DESC
SELECT * FROM `liuyan` ORDER BY `l_id` DESC LIMIT 4

		public function actionUpdate(){
			$request=Yii::$app->request;
			$id=$request->get('id');
			$name=$request->get('name');

			$result=Liuyan::find()->where(['l_id'=>$id])->one();
			$result->l_name=''.$name.'';
			$re=$result->save();
			if($re){
				$query = Liuyan::find()->orderBy('l_id desc');
				$countQuery = clone $query;
				$pages = new Pagination([
					'totalCount' => $countQuery->count(),
					'pageSize'=>4
					]);
				$models = $query->offset($pages->offset)
					->limit($pages->limit)
					->all();
---
SELECT * FROM `liuyan` WHERE `l_id`='39'
SELECT COUNT(*) FROM `liuyan` ORDER BY `l_id` DESC
SELECT * FROM `liuyan` ORDER BY `l_id` DESC LIMIT 4